In [4]:
import pandas as pd
import numpy as np
student=pd.read_csv('D:\\AIML-B2\\student.csv')
marks=pd.read_csv('D:\\AIML-B2\\marks1.csv')
df_merge=pd.merge(student,marks,on='student_id')
df_merge

   student_id        name subject  m1  m2  m3
0           1    suraksha      AI  89  86  65
1           2     prathvi    DBMS  80  93  89
2           3     sandhya  PYTHON  90  79  70
3           4  prathiksha      OS  93  90  87
4           5     lavanya    JAVA  70  87  78

                      intergrating data